Revit 2024 API
RebarCurvesData.ClearAllAddedBarGeometry Method
 This function will remove all bars geometry that were added by calling AddBarGeometry().
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public void ClearAllAddedBarGeometry()
Visual Basic
Public Sub ClearAllAddedBarGeometry
Visual C++
public:
void ClearAllAddedBarGeometry()
See Also
RebarCurvesData Class
Autodesk.Revit.DB.Structure Namespace